from extract_country import get_countries_from_geo_text

# tests
tests = {
    "aaa bbb ccc": [],
    "ქართულ სახელმწიფოს 4 მოსაზღვრე ქვეყანა ყავს: რუსეთი, თურქეთი, სომხეთი და აზერბაიჯანი": [
        "GE",
        "RU",
        "TR",
        "AM",
        "AZ",
    ],
    "საქართველოს ესაზღვრებიან რუსი, თურქი, სომეხი და აზერბაიჯანელი მეზობლები": [
        "GE",
        "RU",
        "TR",
        "AM",
        "AZ",
    ],
    "საქართველომ 2021 წლის 11 თვეში 1.4 მლნ დოლარის 145 ტონა ფეიერვერკები, სასიგნალო შუშხუნები, წვიმის რაკეტები და სხვა პიროტექნიკური ნაწარმი შეიძინა. ოფიციალური სტატისტიკის მიხედვით, 2020 წლის ამავე პერიოდთან შედარებით გასული წლის იანვარ-ნოემბერში საქართველომ 59.7%-ით ნაკლები ღირებულების საქონელი შეიძინა, იმპორტირებული სხვადასხვა პიროტექნიკური ნაწარმის მოცულობა კი პანდემიურ წელთან შედარებით 84.5%-ით არის შემცირებული. აღსანიშნია, რომ 2019 წელთან შედარებით აღნიშნული საქონლის საიმპორტო მოცულობების მნიშვნელოვნი კლევა ფიქსირდება (2019 წელი - 5.9 მლნ დოლარი, 1 481 ტონა). 2021 წლის 11 თვეში, წინა წელთან შედარებით ფეიერვერკების, სასიგნალო შუშხუნების, წვიმის რაკეტების და სხვა პიროტექნიკური ნაწარმის იმპორტი ჩინეთიდან, რომელიც წლების განმავლობაში ერთ-ერთი მთავარი საიმპორტო ბაზარი იყო, 83%-ით შემცირდა. საიმპორტო ქვეყნები კი ასეთია: 1. მონტენეგრო - 501.8 ათასი აშშ დოლარი; 2. ბულგარეთი - 393.6 ათასი აშშ დოლარი; 3. ჩინეთი - 278.4 ათასი აშშ დოლარი; 4. პოლონეთი - 169.8 ათასი აშშ დოლარი; 5. გერმანია - 15.2 ათასი აშშ დოლარი; 6. თურქეთი - 11.2 ათასი აშშ დოლარი.": [
        "GE",
        "CN",
        "ME",
        "BG",
        "PL",
        "DE",
        "TR",
    ],
}

for index, (text, answer_countries) in enumerate(tests.items()):

    answer_countries = sorted(answer_countries)
    extracted_counties = get_countries_from_geo_text(text)

    if extracted_counties != answer_countries:
        print(
            f"In test N{index + 1} Result was: {extracted_counties}, should be: {answer_countries}"
        )
